// Напишите программу, которая на вход принимает целое число и выдает его квадрат (число умножить на число)

// Запрос числа от пользователя
Console.Write("введите число: ");
// переменная с целым числом (целочисленный) int
int number = Convert.ToInt32(Console.ReadLine());

Console.WriteLine(number + 1);

// добавили +1